title: Kaspersky Sandbox Task Submitted
id: 884d6b12-d332-486c-9b6d-1aafef1e04f3
status: experimental
description: |
  Detects when a file is submitted to the Kaspersky sandbox system for behavioral analysis.
  Based on Event ID 2610 from 'avp' provider. Matches hash presence to confirm file context.

author: Cristian Souza
date: 2025-07-24
modified: 2025-07-24
level: informational
logsource:
  product: windows
  service: 'Kaspersky Endpoint Security'
detection:
  selection:
    Provider_Name: 'avp'
    EventID: 2610
    Channel: 'Kaspersky Endpoint Security'
  hash_presence:
    Data|contains:
      - 'MD5:'
      - 'SHA256:'
  condition: selection and hash_presence
tags:
  - kaspersky
  - evtx
  - sandbox
  - submission
  - file_analysis
  - hash
  - endpoint_security
ruletype: Sigma
engine: k-evtrace
