title: Kaspersky System Audit Events
id: 8e6e9b30-5e01-4e9d-b771-b0076ea9a49c
status: experimental
description: |
  Detects system-level audit events generated by Kaspersky Endpoint Security.
  Event IDs 6741, 6742, 6755, 6770, 6780, and 7100.

author: Cristian Souza
date: 2025-07-25
modified: 2025-07-25
level: low
logsource:
  product: windows
  service: 'Kaspersky Security'
detection:
  selection:
    EventID:
      - 6741
      - 6742
      - 6755
      - 6770
      - 6780
      - 7100
    Provider_Name: 'SystemAudit'
    Channel: 'Kaspersky Security'
  condition: selection
falsepositives:
  - Normal internal logging of system component behavior
tags:
  - kaspersky
  - evtx
  - system_audit
  - audit
  - endpoint_security
ruletype: Sigma
engine: k-evtrace
